Revit 2027 API
AssemblyInstance.SetTransform Method
 Sets the origin of the assembly instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetTransform(
	Transform trf
)
Public Sub SetTransform (
	trf As Transform
)
public:
void SetTransform(
	Transform^ trf
)
member SetTransform :
        trf : Transform -> unit
Parameters
trf Transform
 Transform to be set.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentsInconsistentException |  trf is not a rigid body transformation.
See Also
Reference
AssemblyInstance Class
Autodesk.Revit.DB Namespace